index.org
#+options: ':nil *:t -:t ::t <:t H:2 \n:nil ^:{} arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Collection of Application Configuration
#+date: <2024-03-11 Mon>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.2 (Org mode 9.6.15)
#+cite_export:
#+property: EXPORT_FILE_NAME: index.html
#+startup: showall
#+setupfile: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* About
This repository is where I keep configuration for various apps (hence the name) that doesn't really need its own separate repository but still usable for different window managers.
* Apps
** GnuPG Agent
:PROPERTIES:
:header-args: :tangle .gnupg/gpg-agent.conf :mkdirp yes
:END:
#+begin_src conf
  allow-emacs-pinentry
  allow-loopback-pinentry
#+end_src
See the [[https://www.gnupg.org/documentation/manuals/gnupg/Agent-Options.html][documentation]] for full options.
** vdirsyncer
:PROPERTIES:
:header-args: :tangle .config/vdirsyncer/config :mkdirp t
:END:
Used for syncing my calendars.
#+begin_src conf -n
  [general]
  # A folder where vdirsyncer can store some metadata about each pair.
  status_path = "~/.local/share/vdirsyncer/status/"

  # CALDAV
  [pair zumstar_calendar]
  a = "zumstar_calendar_local"
  b = "zumstar_calendar_remote"
  collections = ["from a", "from b"]

  [pair mkncorp_calendar]
  a = "mkncorp_calendar_local"
  b = "mkncorp_calendar_remote"
  collections = ["from a", "from b"]

  # Calendars also have a color property
  metadata = ["displayname", "color"]

  [storage zumstar_calendar_local]
  type = "filesystem"
  path = "~/.local/share/calendars/zumstar"
  fileext = ".ics"

  [storage zumstar_calendar_remote]
  type = "caldav"
  url = "http://localhost:1080/users/kristian.alexander@zumstar.co.id/calendar"
  username = "kristian.alexander"
  # The password can also be fetched from the system password storage, netrc or a
  # custom command. See http://vdirsyncer.pimutils.org/en/stable/keyring.html
  password.fetch = ["command", "pass", "show", "zumstar.co.id/kristian.alexander"]

  [storage mkncorp_calendar_local]
  type = "filesystem"
  path = "~/.local/share/calendars/mkncorp"
  fileext = ".ics"

  [storage mkncorp_calendar_remote]
  type = "caldav"
  url = "http://localhost:1081/users/kristian.alexander@mkncorp.com/calendar"
  username = "kristian.alexander"
  # The password can also be fetched from the system password storage, netrc or a
  # custom command. See http://vdirsyncer.pimutils.org/en/stable/keyring.html
  password.fetch = ["command", "pass", "show", "mkncorp.com/kristian.alexander"]
#+end_src
** Tmux
I still prefer /screen/, but everyone think this is more superior, better see it for my self. This configuration requires [[https://github.com/tmux-plugins/tpm/][tpm]] or Tmux Plugin Manager, though it still usable without it.
#+caption: do this after stowing
#+begin_src sh
  cd ~/.config/tmux
  git clone https://github.com/tmux-plugins/tpm.git plugins/tpm
#+end_src
Note that I don't use plugins at the moment, I still want to explore its builtin capabilities first before venturing into plugins.
