index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-02 Fri 12:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Collection of Application Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kristian Alexander P" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Collection of Application Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1bdd26">About</a></li>
<li><a href="#orgb217e7f">Apps</a>
<ul>
<li><a href="#org7072cb6">GnuPG Agent</a></li>
<li><a href="#org96a92ea">vdirsyncer</a></li>
<li><a href="#orgdf66c3e">Tmux</a></li>
<li><a href="#orgf328384">Tint2</a></li>
<li><a href="#orgff8b15c">systemd</a></li>
<li><a href="#org8df24b2">swaylock</a></li>
<li><a href="#org96b9bd0">swappy</a></li>
<li><a href="#org4f48f82">screen</a></li>
<li><a href="#org835117b">rofi-rbw</a></li>
<li><a href="#org79e5ca4">rofi-pass</a></li>
<li><a href="#orgbc8898d">Rofi</a></li>
<li><a href="#orgc160a48">picom</a></li>
<li><a href="#org262edbf">offlineimap</a></li>
<li><a href="#orgf1869d3">msmtp</a></li>
<li><a href="#org2d2d6f8">GTK</a></li>
<li><a href="#org019d867">Dunst</a></li>
<li><a href="#org9b5ae93">astroid</a></li>
<li><a href="#orgb524e86">alacritty</a></li>
</ul>
</li>
<li><a href="#org1baa521">Scripts</a>
<ul>
<li><a href="#orgbbe8cb1">offlineimap-helper</a></li>
<li><a href="#org0df0837">dunst-backlight</a></li>
<li><a href="#org708ddf4">dunst-volume</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1bdd26" class="outline-2">
<h2 id="orgf1bdd26">About</h2>
<div class="outline-text-2" id="text-orgf1bdd26">
<p>
This repository is where I keep configuration for various apps (hence the name) that doesn't really need its own separate repository but still usable for different window managers.
</p>
</div>
</div>
<div id="outline-container-orgb217e7f" class="outline-2">
<h2 id="orgb217e7f">Apps</h2>
<div class="outline-text-2" id="text-orgb217e7f">
</div>
<div id="outline-container-org7072cb6" class="outline-3">
<h3 id="org7072cb6">GnuPG Agent</h3>
<div class="outline-text-3" id="text-org7072cb6">
<div class="org-src-container">
<pre class="src src-conf">allow-emacs-pinentry
allow-loopback-pinentry
</pre>
</div>
<p>
See the <a href="https://www.gnupg.org/documentation/manuals/gnupg/Agent-Options.html">documentation</a> for full options.
</p>
</div>
</div>
<div id="outline-container-org96a92ea" class="outline-3">
<h3 id="org96a92ea">vdirsyncer</h3>
<div class="outline-text-3" id="text-org96a92ea">
<p>
Used for syncing my calendars.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr"> 1: </span>[<span style="color: #228b22;">general</span>]
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">A folder where vdirsyncer can store some metadata about each pair.</span>
<span class="linenr"> 3: </span><span style="color: #b8860b;">status_path</span> = <span style="color: #bc8f8f;">"~/.local/share/vdirsyncer/status/"</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">CALDAV</span>
<span class="linenr"> 6: </span>[<span style="color: #228b22;">pair zumstar_calendar</span>]
<span class="linenr"> 7: </span><span style="color: #b8860b;">a</span> = <span style="color: #bc8f8f;">"zumstar_calendar_local"</span>
<span class="linenr"> 8: </span><span style="color: #b8860b;">b</span> = <span style="color: #bc8f8f;">"zumstar_calendar_remote"</span>
<span class="linenr"> 9: </span><span style="color: #b8860b;">collections</span> = [<span style="color: #bc8f8f;">"from a"</span>, <span style="color: #bc8f8f;">"from b"</span>]
<span class="linenr">10: </span>
<span class="linenr">11: </span>[<span style="color: #228b22;">pair mkncorp_calendar</span>]
<span class="linenr">12: </span><span style="color: #b8860b;">a</span> = <span style="color: #bc8f8f;">"mkncorp_calendar_local"</span>
<span class="linenr">13: </span><span style="color: #b8860b;">b</span> = <span style="color: #bc8f8f;">"mkncorp_calendar_remote"</span>
<span class="linenr">14: </span><span style="color: #b8860b;">collections</span> = [<span style="color: #bc8f8f;">"from a"</span>, <span style="color: #bc8f8f;">"from b"</span>]
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">Calendars also have a color property</span>
<span class="linenr">17: </span><span style="color: #b8860b;">metadata</span> = [<span style="color: #bc8f8f;">"displayname"</span>, <span style="color: #bc8f8f;">"color"</span>]
<span class="linenr">18: </span>
<span class="linenr">19: </span>[<span style="color: #228b22;">storage zumstar_calendar_local</span>]
<span class="linenr">20: </span><span style="color: #b8860b;">type</span> = <span style="color: #bc8f8f;">"filesystem"</span>
<span class="linenr">21: </span><span style="color: #b8860b;">path</span> = <span style="color: #bc8f8f;">"~/.local/share/calendars/zumstar"</span>
<span class="linenr">22: </span><span style="color: #b8860b;">fileext</span> = <span style="color: #bc8f8f;">".ics"</span>
<span class="linenr">23: </span>
<span class="linenr">24: </span>[<span style="color: #228b22;">storage zumstar_calendar_remote</span>]
<span class="linenr">25: </span><span style="color: #b8860b;">type</span> = <span style="color: #bc8f8f;">"caldav"</span>
<span class="linenr">26: </span><span style="color: #b8860b;">url</span> = <span style="color: #bc8f8f;">"http://localhost:1080/users/kristian.alexander@zumstar.co.id/calendar"</span>
<span class="linenr">27: </span><span style="color: #b8860b;">username</span> = <span style="color: #bc8f8f;">"kristian.alexander"</span>
<span class="linenr">28: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The password can also be fetched from the system password storage, netrc or a</span>
<span class="linenr">29: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">custom command. See http://vdirsyncer.pimutils.org/en/stable/keyring.html</span>
<span class="linenr">30: </span><span style="color: #b8860b;">password.fetch</span> = [<span style="color: #bc8f8f;">"command"</span>, <span style="color: #bc8f8f;">"pass"</span>, <span style="color: #bc8f8f;">"show"</span>, <span style="color: #bc8f8f;">"zumstar.co.id/kristian.alexander"</span>]
<span class="linenr">31: </span>
<span class="linenr">32: </span>[<span style="color: #228b22;">storage mkncorp_calendar_local</span>]
<span class="linenr">33: </span><span style="color: #b8860b;">type</span> = <span style="color: #bc8f8f;">"filesystem"</span>
<span class="linenr">34: </span><span style="color: #b8860b;">path</span> = <span style="color: #bc8f8f;">"~/.local/share/calendars/mkncorp"</span>
<span class="linenr">35: </span><span style="color: #b8860b;">fileext</span> = <span style="color: #bc8f8f;">".ics"</span>
<span class="linenr">36: </span>
<span class="linenr">37: </span>[<span style="color: #228b22;">storage mkncorp_calendar_remote</span>]
<span class="linenr">38: </span><span style="color: #b8860b;">type</span> = <span style="color: #bc8f8f;">"caldav"</span>
<span class="linenr">39: </span><span style="color: #b8860b;">url</span> = <span style="color: #bc8f8f;">"http://localhost:1081/users/kristian.alexander@mkncorp.com/calendar"</span>
<span class="linenr">40: </span><span style="color: #b8860b;">username</span> = <span style="color: #bc8f8f;">"kristian.alexander"</span>
<span class="linenr">41: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">The password can also be fetched from the system password storage, netrc or a</span>
<span class="linenr">42: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">custom command. See http://vdirsyncer.pimutils.org/en/stable/keyring.html</span>
<span class="linenr">43: </span><span style="color: #b8860b;">password.fetch</span> = [<span style="color: #bc8f8f;">"command"</span>, <span style="color: #bc8f8f;">"pass"</span>, <span style="color: #bc8f8f;">"show"</span>, <span style="color: #bc8f8f;">"mkncorp.com/kristian.alexander"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf66c3e" class="outline-3">
<h3 id="orgdf66c3e">Tmux</h3>
<div class="outline-text-3" id="text-orgdf66c3e">
<p>
I still prefer <i>screen</i>, but everyone think this is more superior, better see it for my self. This configuration requires <a href="https://github.com/tmux-plugins/tpm/">tpm</a> or Tmux Plugin Manager, though it still usable without it.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>do this after stowing</label><pre class="src src-sh"><span style="color: #00008b;">cd</span> ~/.config/tmux
git clone https://github.com/tmux-plugins/tpm.git plugins/tpm
</pre>
</div>
<p>
Note that I don't use plugins at the moment, I still want to explore its builtin capabilities first before venturing into plugins.
</p>
</div>
<ul class="org-ul">
