index.html
<div id="outline-container-org4f48f82" class="outline-3">
<h3 id="org4f48f82">screen</h3>
<div class="outline-text-3" id="text-org4f48f82">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/screen/screenrc</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">By default, screen will look for initialization in</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">either /usr/local/etc/screenrc or /etc/screenrc, or to wherever</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">the environment variable ${SYSSCREENRC} is set.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">As for the default user configuration file is default to</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">${HOME}/.screenrc or to ${SCREENRC} if defined.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">so without the environment variable, this file won't be loaded.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">As always, when in doubt, see man 1 screen</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Note: all these commands started with the escape key,</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">default to 'c-a' (ctrl-a)</span>
autodetach on <span style="color: #b22222;"># </span><span style="color: #b22222;">default: on</span>
startup_message off <span style="color: #b22222;"># </span><span style="color: #b22222;">default: on</span>
defscrollback 10000 <span style="color: #b22222;"># </span><span style="color: #b22222;">default: 100</span>
hardstatus alwayslastline
hardstatus string <span style="color: #bc8f8f;">'%{= kG}[ %{G}%H %{g}][%= %{= kw}%?%-Lw%?%{r}(%{W}%n*%f%t%?(%u)%?%{r})%{w}%?%+Lw%?%?%= %{g}][%{B} %m-%d %{W}%c %{g}]'']'</span>
attrcolor b <span style="color: #bc8f8f;">".I"</span>
termcapinfo xterm <span style="color: #bc8f8f;">'Co#256:AB=\E[48;5;%dm:AF=\E[38;5;%dm'</span>
defbce on
multiuser off
bufferfile ${SCREENDIR}/.screen_exchange
shell -${SHELL}
pow_detach_msg <span style="color: #bc8f8f;">"Screen session of \$LOGNAME \$:cr:\$:nl:ended."</span>
defnonblock on
layout autosave on
layout new one
select 1
layout new two
select 1
split
resize -v +8
focus down
select 4
focus up
layout new three
select 1
split
resize -v +7
focus down
select 3
split -v
resize -h +10
focus right
select 4
focus up

layout attach one
layout select one
mousetrack on
<span style="color: #b8860b;">termcap  xterm hs@:cs</span>=\E[%i%d;%dr:im=\E[4h:ei=\E[4l
<span style="color: #b8860b;">terminfo xterm hs@:cs</span>=\E[%i%p1%d;%p2%dr:im=\E[4h:ei=\E[4
termcapinfo xterm <span style="color: #bc8f8f;">'VR=\E[?5h:VN=\E[?5l'</span>
termcapinfo xterm <span style="color: #bc8f8f;">'k1=\E[11~:k2=\E[12~:k3=\E[13~:k4=\E[14~'</span>
termcapinfo xterm <span style="color: #bc8f8f;">'kh=\EOH:kI=\E[2~:kD=\E[3~:kH=\EOF:kP=\E[5~:kN=\E[6~'</span>
termcapinfo xterm <span style="color: #bc8f8f;">'hs:ts=\E]2;:fs=\007:ds=\E]2;screen\007'</span>
termcapinfo  * <span style="color: #bc8f8f;">''</span> <span style="color: #bc8f8f;">'hs:ts=\E_:fs=\E\\:ds=\E_\E\\'</span>
termcapinfo xterm* ti@:te@
altscreen on
</pre>
</div>
<p>
My ultimate terminal multiplexer, for this to work you'll need you'll need to set the environment variable <code>SCREENRC</code>, I set this so I don't have to use the default location (<code>/.screenrc</code>).
</p>
</div>
</div>
<div id="outline-container-org835117b" class="outline-3">
<h3 id="org835117b">rofi-rbw</h3>
<div class="outline-text-3" id="text-org835117b">
<p>
Rofi frontend for rbw (CLI for bitwarden), though I don't think it really needs a configuration file. I actually migrating from <i>bitwarden</i> to pass.
</p>
<div class="org-src-container">
<pre class="src src-conf"><span class="linenr">1: </span><span style="color: #b8860b;">selector</span>=rofi
<span class="linenr">2: </span><span style="color: #b8860b;">clipboarder</span>=wl-copy
<span class="linenr">3: </span><span style="color: #b8860b;">typer</span>=wtype
<span class="linenr">4: </span><span style="color: #b8860b;">action</span>=copy
</pre>
</div>
</div>
</div>
