index.html
<li><a id="org50b14f9"></a>scripts<br />
<ul class="org-ul">
<li><a id="org09799ca"></a>rofi-logout<br />
<div class="outline-text-5" id="text-org09799ca">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b8860b;">THEME</span>=${<span style="color: #b8860b;">1</span>:-logout}

<span style="color: #b8860b;">question</span>=$(<span style="color: #00008b;">echo</span> <span style="color: #bc8f8f;">"&#983870; lock|&#983875; logout|&#984841; reboot|&#984101; shutdown"</span> | rofi -sep <span style="color: #bc8f8f;">"|"</span> <span style="color: #bc8f8f;">\</span>
    -dmenu -i -p <span style="color: #bc8f8f;">'System: '</span> <span style="color: #bc8f8f;">""</span> <span style="color: #bc8f8f;">\</span>
    -hide-scrollbar <span style="color: #bc8f8f;">\</span>
    -eh 1 <span style="color: #bc8f8f;">\</span>
    -color-enabled true <span style="color: #bc8f8f;">\</span>
    -theme <span style="color: #bc8f8f;">"$THEME"</span>)

<span style="color: #4169e1;">case</span> $<span style="color: #b8860b;">question</span><span style="color: #4169e1;"> in</span>
    *lock)
        <span style="color: #4169e1;">case</span> $<span style="color: #b8860b;">DESKTOP_SESSION</span><span style="color: #4169e1;"> in</span>
            hyprland)
                hyprctl dispatch exit
                ;;
            *)
                <span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"$(pgrep -x lightdm)"</span> ] &amp;&amp; [ <span style="color: #bc8f8f;">"$(command -v light-locker)"</span> ]; <span style="color: #4169e1;">then</span>
                    light-locker-command -l
                <span style="color: #4169e1;">fi</span>
                ;;
        <span style="color: #4169e1;">esac</span>
        ;;
    *logout)
        <span style="color: #4169e1;">case</span> $<span style="color: #b8860b;">DESKTOP_SESSION</span><span style="color: #4169e1;"> in</span>
            hyprland)
                hyprctl dispatch exit
                ;;
            openbox)
                openbox --exit
                ;;
            i3)
                i3-msg exit
                ;;
            qtile)
                qtile cmd-obj -o cmd -f shutdown
                ;;
        <span style="color: #4169e1;">esac</span>
        ;;
    *reboot)
        <span style="color: #4169e1;">if</span> [[ $(command -v systemctl) ]]; <span style="color: #4169e1;">then</span>
            systemctl reboot
        <span style="color: #4169e1;">else</span>
            shutdown -r now
        <span style="color: #4169e1;">fi</span>
        ;;
    *shutdown)
        <span style="color: #4169e1;">if</span> [[ $(command -v systemctl) ]]; <span style="color: #4169e1;">then</span>
            systemctl poweroff
        <span style="color: #4169e1;">else</span>
            poweroff
        <span style="color: #4169e1;">fi</span>
        ;;
    *)
        <span style="color: #4169e1;">exit</span> 0  <span style="color: #b22222;"># </span><span style="color: #b22222;">do nothing on wrong response</span>
        ;;
<span style="color: #4169e1;">esac</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
