index.org
** astroid
:PROPERTIES:
:header-args: :tangle .config/astroid/config :mkdirp t
:END:
#+begin_src js
  {
      "astroid": {
          "config": {
              "version": "11"
          },
          "notmuch_config": "\/home\/mkncorp.com\/kristian.alexander\/.notmuch-config",
          "debug": {
              "dryrun_sending": "false"
          },
          "hints": {
              "level": "0"
          },
          "log": {
              "syslog": "false",
              "stdout": "true",
              "level": "info"
          }
      },
      "accounts": {
          "gmail": {
              "name": "Kristian Alexander P",
              "email": "alexarians@gmail.com",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/gmail\/sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/gmail\/draft\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          },
          "hotmail": {
              "name": "Kristian Alexander P",
              "email": "christian.alexander@windowslive.com",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/hotmail\/sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/hotmail\/draft\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          },
          "mkn": {
              "name": "Kristian Alexander P",
              "email": "kristian.alexander@mkncorp.com",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/mkn\/Sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/mkn\/Drafts\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          },
          "yahoo": {
              "name": "Kristian Alexander P",
              "email": "alexforsale@yahoo.com",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/yahoo\/sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/yahoo\/draft\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          },
          "ymail": {
              "name": "Kristian Alexander P",
              "email": "christian.alexander@ymail.com",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/ymail\/sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/ymail\/draft\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          },
          "zum": {
              "name": "Kristian Alexander P",
              "email": "kristian.alexander@zumstar.co.id",
              "gpgkey": "27517709E592F14C5A51D90B972B3C2D613E4AE9",
              "always_gpg_sign": "true",
              "sendmail": "msmtp -i -t",
              "default": "true",
              "save_sent": "false",
              "save_sent_to": "\/home\/mkncorp.com\/kristian.alexander\/.mail\/zum\/Sent\/cur\/",
              "additional_sent_tags": "",
              "save_drafts_to": "\/home\/mkncorp\/kristian.alexander\/.mail\/zum\/Drafts\/",
              "signature_separate": "false",
              "signature_file": "",
              "signature_file_markdown": "",
              "signature_default_on": "true",
              "signature_attach": "false",
              "select_query": ""
          }
      },
      "startup": {
          "queries": {
              "gmail": "tag:gmail and tag:inbox",
              "hotmail": "tag:hotmail and tag:inbox",
              "mkn": "tag:mkn and tag:inbox",
              "yahoo": "tag:yahoo and tag:inbox",
              "ymail": "tag:ymail and tag:inbox",
              "zum": "tag:mkn and tag:inbox"
          }
      },
      "terminal": {
          "height": "10",
          "font_description": "default"
      },
      "thread_index": {
          "page_jump_rows": "6",
          "sort_order": "newest",
          "cell": {
              "font_description": "default",
              "line_spacing": "2",
              "date_length": "10",
              "message_count_length": "4",
              "authors_length": "20",
              "subject_color": "#807d74",
              "subject_color_selected": "#000000",
              "background_color_selected": "",
              "background_color_marked": "#fff584",
              "background_color_marked_selected": "#bcb559",
              "tags_length": "80",
              "tags_upper_color": "#e5e5e5",
              "tags_lower_color": "#333333",
              "tags_alpha": "0.5",
              "hidden_tags": "attachment,flagged,unread"
          }
      },
      "general": {
          "time": {
              "clock_format": "local",
              "same_year": "%b %-e",
              "diff_year": "%x"
          },
          "tagbar_move": "tag"
      },
      "editor": {
          "cmd.orig": "gvim -geom 10x10 --servername %2 --socketid %3 -f -c 'set ft=mail' '+set fileencoding=utf-8' '+set ff=unix' '+set enc=utf-8' '+set fo+=w' %1",
          "cmd": "emacs --parent-id %3 %1",
          "external_editor": "false",
          "charset": "utf-8",
          "save_draft_on_force_quit": "true",
          "attachment_words": "attach",
          "attachment_directory": "~",
          "markdown_processor": "cmark",
          "markdown_on": "false"
      },
      "mail": {
          "reply": {
              "quote_processor": "w3m -dump -T text\/html",
              "quote_line": "Excerpts from %1's message of %2:",
              "mailinglist_reply_to_sender": "true"
          },
          "forward": {
              "quote_line": "Forwarding %1's message of %2:",
              "disposition": "inline"
          },
          "sent_tags": "sent",
          "message_id_fqdn": "",
          "message_id_user": "",
          "user_agent": "default",
          "send_delay": "2",
          "close_on_success": "false",
          "format_flowed": "false"
      },
      "poll": {
          "interval": "600",
          "always_full_refresh": "false"
      },
      "attachment": {
          "external_open_cmd": "xdg-open"
      },
      "thread_view": {
          "open_html_part_external": "false",
          "preferred_type": "plain",
          "preferred_html_only": "false",
          "allow_remote_when_encrypted": "false",
          "open_external_link": "xdg-open",
          "default_save_directory": "~",
          "indent_messages": "false",
          "gravatar": {
              "enable": "true"
          },
          "mark_unread_delay": "0.5",
          "expand_flagged": "true"
      },
      "crypto": {
          "gpg": {
              "path": "gpg2",
              "always_trust": "true",
              "enabled": "true"
          }
      },
      "saved_searches": {
          "show_on_startup": "false",
          "save_history": "true",
          "history_lines_to_show": "15",
          "history_lines": "1000"
      }
  }
#+end_src
