index.html
<div id="outline-container-org9b5ae93" class="outline-3">
<h3 id="org9b5ae93">astroid</h3>
<div class="outline-text-3" id="text-org9b5ae93">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #bc8f8f;">"astroid"</span>: {
        <span style="color: #bc8f8f;">"config"</span>: {
            <span style="color: #bc8f8f;">"version"</span>: <span style="color: #bc8f8f;">"11"</span>
        },
        <span style="color: #bc8f8f;">"notmuch_config"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.notmuch-config"</span>,
        <span style="color: #bc8f8f;">"debug"</span>: {
            <span style="color: #bc8f8f;">"dryrun_sending"</span>: <span style="color: #bc8f8f;">"false"</span>
        },
        <span style="color: #bc8f8f;">"hints"</span>: {
            <span style="color: #bc8f8f;">"level"</span>: <span style="color: #bc8f8f;">"0"</span>
        },
        <span style="color: #bc8f8f;">"log"</span>: {
            <span style="color: #bc8f8f;">"syslog"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"stdout"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"level"</span>: <span style="color: #bc8f8f;">"info"</span>
        }
    },
    <span style="color: #bc8f8f;">"accounts"</span>: {
        <span style="color: #bc8f8f;">"gmail"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"alexarians@gmail.com"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/gmail\/sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/gmail\/draft\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        },
        <span style="color: #bc8f8f;">"hotmail"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"christian.alexander@windowslive.com"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/hotmail\/sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/hotmail\/draft\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        },
        <span style="color: #bc8f8f;">"mkn"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"kristian.alexander@mkncorp.com"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/mkn\/Sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/mkn\/Drafts\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        },
        <span style="color: #bc8f8f;">"yahoo"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"alexforsale@yahoo.com"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/yahoo\/sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/yahoo\/draft\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        },
        <span style="color: #bc8f8f;">"ymail"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"christian.alexander@ymail.com"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/ymail\/sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/ymail\/draft\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        },
        <span style="color: #bc8f8f;">"zum"</span>: {
            <span style="color: #bc8f8f;">"name"</span>: <span style="color: #bc8f8f;">"Kristian Alexander P"</span>,
            <span style="color: #bc8f8f;">"email"</span>: <span style="color: #bc8f8f;">"kristian.alexander@zumstar.co.id"</span>,
            <span style="color: #bc8f8f;">"gpgkey"</span>: <span style="color: #bc8f8f;">"27517709E592F14C5A51D90B972B3C2D613E4AE9"</span>,
            <span style="color: #bc8f8f;">"always_gpg_sign"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"sendmail"</span>: <span style="color: #bc8f8f;">"msmtp -i -t"</span>,
            <span style="color: #bc8f8f;">"default"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"save_sent"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"save_sent_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp.com\/kristian.alexander\/.mail\/zum\/Sent\/cur\/"</span>,
            <span style="color: #bc8f8f;">"additional_sent_tags"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"save_drafts_to"</span>: <span style="color: #bc8f8f;">"\/home\/mkncorp\/kristian.alexander\/.mail\/zum\/Drafts\/"</span>,
            <span style="color: #bc8f8f;">"signature_separate"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"signature_file"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_file_markdown"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"signature_default_on"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"signature_attach"</span>: <span style="color: #bc8f8f;">"false"</span>,
            <span style="color: #bc8f8f;">"select_query"</span>: <span style="color: #bc8f8f;">""</span>
        }
    },
    <span style="color: #bc8f8f;">"startup"</span>: {
        <span style="color: #bc8f8f;">"queries"</span>: {
            <span style="color: #bc8f8f;">"gmail"</span>: <span style="color: #bc8f8f;">"tag:gmail and tag:inbox"</span>,
            <span style="color: #bc8f8f;">"hotmail"</span>: <span style="color: #bc8f8f;">"tag:hotmail and tag:inbox"</span>,
            <span style="color: #bc8f8f;">"mkn"</span>: <span style="color: #bc8f8f;">"tag:mkn and tag:inbox"</span>,
            <span style="color: #bc8f8f;">"yahoo"</span>: <span style="color: #bc8f8f;">"tag:yahoo and tag:inbox"</span>,
            <span style="color: #bc8f8f;">"ymail"</span>: <span style="color: #bc8f8f;">"tag:ymail and tag:inbox"</span>,
            <span style="color: #bc8f8f;">"zum"</span>: <span style="color: #bc8f8f;">"tag:mkn and tag:inbox"</span>
        }
    },
    <span style="color: #bc8f8f;">"terminal"</span>: {
        <span style="color: #bc8f8f;">"height"</span>: <span style="color: #bc8f8f;">"10"</span>,
        <span style="color: #bc8f8f;">"font_description"</span>: <span style="color: #bc8f8f;">"default"</span>
    },
    <span style="color: #bc8f8f;">"thread_index"</span>: {
        <span style="color: #bc8f8f;">"page_jump_rows"</span>: <span style="color: #bc8f8f;">"6"</span>,
        <span style="color: #bc8f8f;">"sort_order"</span>: <span style="color: #bc8f8f;">"newest"</span>,
        <span style="color: #bc8f8f;">"cell"</span>: {
            <span style="color: #bc8f8f;">"font_description"</span>: <span style="color: #bc8f8f;">"default"</span>,
            <span style="color: #bc8f8f;">"line_spacing"</span>: <span style="color: #bc8f8f;">"2"</span>,
            <span style="color: #bc8f8f;">"date_length"</span>: <span style="color: #bc8f8f;">"10"</span>,
            <span style="color: #bc8f8f;">"message_count_length"</span>: <span style="color: #bc8f8f;">"4"</span>,
            <span style="color: #bc8f8f;">"authors_length"</span>: <span style="color: #bc8f8f;">"20"</span>,
            <span style="color: #bc8f8f;">"subject_color"</span>: <span style="color: #bc8f8f;">"#807d74"</span>,
            <span style="color: #bc8f8f;">"subject_color_selected"</span>: <span style="color: #bc8f8f;">"#000000"</span>,
            <span style="color: #bc8f8f;">"background_color_selected"</span>: <span style="color: #bc8f8f;">""</span>,
            <span style="color: #bc8f8f;">"background_color_marked"</span>: <span style="color: #bc8f8f;">"#fff584"</span>,
            <span style="color: #bc8f8f;">"background_color_marked_selected"</span>: <span style="color: #bc8f8f;">"#bcb559"</span>,
            <span style="color: #bc8f8f;">"tags_length"</span>: <span style="color: #bc8f8f;">"80"</span>,
            <span style="color: #bc8f8f;">"tags_upper_color"</span>: <span style="color: #bc8f8f;">"#e5e5e5"</span>,
            <span style="color: #bc8f8f;">"tags_lower_color"</span>: <span style="color: #bc8f8f;">"#333333"</span>,
            <span style="color: #bc8f8f;">"tags_alpha"</span>: <span style="color: #bc8f8f;">"0.5"</span>,
            <span style="color: #bc8f8f;">"hidden_tags"</span>: <span style="color: #bc8f8f;">"attachment,flagged,unread"</span>
        }
    },
    <span style="color: #bc8f8f;">"general"</span>: {
        <span style="color: #bc8f8f;">"time"</span>: {
            <span style="color: #bc8f8f;">"clock_format"</span>: <span style="color: #bc8f8f;">"local"</span>,
            <span style="color: #bc8f8f;">"same_year"</span>: <span style="color: #bc8f8f;">"%b %-e"</span>,
            <span style="color: #bc8f8f;">"diff_year"</span>: <span style="color: #bc8f8f;">"%x"</span>
        },
        <span style="color: #bc8f8f;">"tagbar_move"</span>: <span style="color: #bc8f8f;">"tag"</span>
    },
    <span style="color: #bc8f8f;">"editor"</span>: {
        <span style="color: #bc8f8f;">"cmd.orig"</span>: <span style="color: #bc8f8f;">"gvim -geom 10x10 --servername %2 --socketid %3 -f -c 'set ft=mail' '+set fileencoding=utf-8' '+set ff=unix' '+set enc=utf-8' '+set fo+=w' %1"</span>,
        <span style="color: #bc8f8f;">"cmd"</span>: <span style="color: #bc8f8f;">"emacs --parent-id %3 %1"</span>,
        <span style="color: #bc8f8f;">"external_editor"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"charset"</span>: <span style="color: #bc8f8f;">"utf-8"</span>,
        <span style="color: #bc8f8f;">"save_draft_on_force_quit"</span>: <span style="color: #bc8f8f;">"true"</span>,
        <span style="color: #bc8f8f;">"attachment_words"</span>: <span style="color: #bc8f8f;">"attach"</span>,
        <span style="color: #bc8f8f;">"attachment_directory"</span>: <span style="color: #bc8f8f;">"~"</span>,
        <span style="color: #bc8f8f;">"markdown_processor"</span>: <span style="color: #bc8f8f;">"cmark"</span>,
        <span style="color: #bc8f8f;">"markdown_on"</span>: <span style="color: #bc8f8f;">"false"</span>
    },
    <span style="color: #bc8f8f;">"mail"</span>: {
        <span style="color: #bc8f8f;">"reply"</span>: {
            <span style="color: #bc8f8f;">"quote_processor"</span>: <span style="color: #bc8f8f;">"w3m -dump -T text\/html"</span>,
            <span style="color: #bc8f8f;">"quote_line"</span>: <span style="color: #bc8f8f;">"Excerpts from %1's message of %2:"</span>,
            <span style="color: #bc8f8f;">"mailinglist_reply_to_sender"</span>: <span style="color: #bc8f8f;">"true"</span>
        },
        <span style="color: #bc8f8f;">"forward"</span>: {
            <span style="color: #bc8f8f;">"quote_line"</span>: <span style="color: #bc8f8f;">"Forwarding %1's message of %2:"</span>,
            <span style="color: #bc8f8f;">"disposition"</span>: <span style="color: #bc8f8f;">"inline"</span>
        },
        <span style="color: #bc8f8f;">"sent_tags"</span>: <span style="color: #bc8f8f;">"sent"</span>,
        <span style="color: #bc8f8f;">"message_id_fqdn"</span>: <span style="color: #bc8f8f;">""</span>,
        <span style="color: #bc8f8f;">"message_id_user"</span>: <span style="color: #bc8f8f;">""</span>,
        <span style="color: #bc8f8f;">"user_agent"</span>: <span style="color: #bc8f8f;">"default"</span>,
        <span style="color: #bc8f8f;">"send_delay"</span>: <span style="color: #bc8f8f;">"2"</span>,
        <span style="color: #bc8f8f;">"close_on_success"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"format_flowed"</span>: <span style="color: #bc8f8f;">"false"</span>
    },
    <span style="color: #bc8f8f;">"poll"</span>: {
        <span style="color: #bc8f8f;">"interval"</span>: <span style="color: #bc8f8f;">"600"</span>,
        <span style="color: #bc8f8f;">"always_full_refresh"</span>: <span style="color: #bc8f8f;">"false"</span>
    },
    <span style="color: #bc8f8f;">"attachment"</span>: {
        <span style="color: #bc8f8f;">"external_open_cmd"</span>: <span style="color: #bc8f8f;">"xdg-open"</span>
    },
    <span style="color: #bc8f8f;">"thread_view"</span>: {
        <span style="color: #bc8f8f;">"open_html_part_external"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"preferred_type"</span>: <span style="color: #bc8f8f;">"plain"</span>,
        <span style="color: #bc8f8f;">"preferred_html_only"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"allow_remote_when_encrypted"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"open_external_link"</span>: <span style="color: #bc8f8f;">"xdg-open"</span>,
        <span style="color: #bc8f8f;">"default_save_directory"</span>: <span style="color: #bc8f8f;">"~"</span>,
        <span style="color: #bc8f8f;">"indent_messages"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"gravatar"</span>: {
            <span style="color: #bc8f8f;">"enable"</span>: <span style="color: #bc8f8f;">"true"</span>
        },
        <span style="color: #bc8f8f;">"mark_unread_delay"</span>: <span style="color: #bc8f8f;">"0.5"</span>,
        <span style="color: #bc8f8f;">"expand_flagged"</span>: <span style="color: #bc8f8f;">"true"</span>
    },
    <span style="color: #bc8f8f;">"crypto"</span>: {
        <span style="color: #bc8f8f;">"gpg"</span>: {
            <span style="color: #bc8f8f;">"path"</span>: <span style="color: #bc8f8f;">"gpg2"</span>,
            <span style="color: #bc8f8f;">"always_trust"</span>: <span style="color: #bc8f8f;">"true"</span>,
            <span style="color: #bc8f8f;">"enabled"</span>: <span style="color: #bc8f8f;">"true"</span>
        }
    },
    <span style="color: #bc8f8f;">"saved_searches"</span>: {
        <span style="color: #bc8f8f;">"show_on_startup"</span>: <span style="color: #bc8f8f;">"false"</span>,
        <span style="color: #bc8f8f;">"save_history"</span>: <span style="color: #bc8f8f;">"true"</span>,
        <span style="color: #bc8f8f;">"history_lines_to_show"</span>: <span style="color: #bc8f8f;">"15"</span>,
        <span style="color: #bc8f8f;">"history_lines"</span>: <span style="color: #bc8f8f;">"1000"</span>
    }
}
</pre>
</div>
</div>
</div>
