index.org
** alacritty
*** alacritty.toml
:PROPERTIES:
:header-args: :tangle .config/alacritty/alacritty.toml :mkdirp t
:END:
#+begin_src toml -n
  import = ["~/.config/alacritty/themes/nord.toml"]
  live_config_reload = true
  [window]
  dynamic_padding = true
  decorations = "None"
  padding = { x = 25, y = 25 }
  blur = true
  startup_mode = "Fullscreen"
  decorations_theme_variant = "Dark"
  [scrolling]
  history = 100000
  multiplier = 2
  [font]
  normal = { family = "SpaceMono Nerd Font", style = "Regular" }
  bold = { family = "SpaceMono Nerd Font", style = "Bold" }
  italic = { family = "SpaceMono Nerd Font", style = "Italic" }
  bold_italic = { family = "SpaceMono Nerd Font", style = "Semibold Italic" }
  size = 11
  [bell]
  animation = "EaseOutCirc"
  duration = 1
  # command = { program = "canberra-gtk-play", args = ["-i", "bell"] }
  [cursor]
  style = { shape = "Beam", blinking = "On" }
  vi_mode_style = { shape = "Block", blinking = "Off" }
  [mouse]
  hide_when_typing = true
  [selection]
  save_to_clipboard = true
  [shell]
  program = "/bin/bash"
  args = ["-l"]
  [[hints.enabled]]
  command = "xdg-open"
  hyperlinks = true
  post_processing = true
  persist = false
  mouse.enabled = true
  binding = { key = "U", mods = "Control|Shift" }
   regex = "(ipfs:|ipns:|magnet:|mailto:|gemini://|gopher://|https://|http://|news:|file:|git://|ssh:|ftp://)[^\u0000-\u001F\u007F-\u009F<>\"\\s{-}\\^⟨⟩`]+"
#+end_src
*** Themes
**** nord
:PROPERTIES:
:header-args: :tangle .config/alacritty/themes/nord.toml :mkdirp t
:END:

#+begin_src toml
  # -*- eval: (rainbow-mode 1) -*-
  # Colors (Nord)

  # Default colors
  [colors.primary]
  background = '#2E3440'
  foreground = '#D8DEE9'

  # Normal colors
  [colors.normal]
  black   = '#3B4252'
  red     = '#BF616A'
  green   = '#A3BE8C'
  yellow  = '#EBCB8B'
  blue    = '#81A1C1'
  magenta = '#B48EAD'
  cyan    = '#88C0D0'
  white   = '#E5E9F0'

  # Bright colors
  [colors.bright]
  black   = '#4C566A'
  red     = '#BF616A'
  green   = '#A3BE8C'
  yellow  = '#EBCB8B'
  blue    = '#81A1C1'
  magenta = '#B48EAD'
  cyan    = '#8FBCBB'
  white   = '#ECEFF4'
#+end_src
* Scripts
** offlineimap-helper
:PROPERTIES:
:header-args: :tangle .local/bin/offlineimap-helper.py :shebang #!/usr/bin/env python :mkdirp t
:END:
#+begin_src python
  """Offlineimap helper script"""

  from subprocess import check_output
  from os import getenv, path
  import json

  JSON_FILE = "credentials.json"
  if getenv("XDG_DATA_HOME") and path.exists(getenv("XDG_DATA_HOME") + "/" + "offlineimap"):
      JSON_PATH = getenv("XDG_DATA_HOME") + "/" + "offlineimap"
  else:
      JSON_PATH = getenv("HOME") + "/" + ".local/share/offlineimap"


  f = open(JSON_PATH + "/" + JSON_FILE)
  creds_data = json.load(f)

  def get_credentials(name, query):
      for item in creds_data["accounts"]:
          if item["name"] == name:
              if query == "host":
                  return item["host"]
              elif query == "port":
                  return item["port"]
              elif query == "user":
                  return item["user"]
              elif query == "passeval":
                  return item["passeval"]
#+end_src
This is a helper script for my /offlineimap/ configuration
** dunst-backlight
:PROPERTIES:
:header-args: :tangle .local/bin/dunst-backlight :shebang #!/usr/bin/env bash
:END:

#+begin_src sh
  # original script from https://wiki.archlinux.org/index.php/Dunst
  # <alexforsale@yahoo.com>
  # changeBrightness

  # Arbitrary but unique message tag
  msgTag="mybrightness"

  # Change the volume using alsa(might differ if you use pulseaudio)
  #amixer -c 0 set Master "$@" > /dev/null
  #pamixer --set-volume "${@}" > /dev/null
  brightnessctl set "${@}" > /dev/null

  # Query amixer for the current volume and whether or not the speaker is muted
  #volume="$(amixer -c 0 get Master | tail -1 | awk '{print $4}' | sed 's/[^0-9]*//g')"
  #mute="$(amixer -c 0 get Master | tail -1 | awk '{print $6}' | sed 's/[^a-z]*//g')"
  #volume="$(pamixer --get-volume-human)"
  #mute="$(pamixer --get-mute)"
  max="$(brightnessctl max)"
  current="$(brightnessctl get)"
  percentage="$(awk -v current=${current} -v max=${max} 'BEGIN { print ( (current / max) * 100 )}')"
  percentage="${percentage%.*}"

  # Show the brightness notification
  dunstify -a "changeBrightness" -u low -i audio-volume-high -h string:x-dunst-stack-tag:$msgTag \
      -h int:value:"${percentage}" " Brightness: ${percentage}%"

  # Play the brightness changed sound
  canberra-gtk-play -i audio-volume-change -d "changeVolume"
#+end_src
