index.html
<div id="outline-container-orgb524e86" class="outline-3">
<h3 id="orgb524e86">alacritty</h3>
<div class="outline-text-3" id="text-orgb524e86">
</div>
<ul class="org-ul">
<li><a id="org70a116d"></a>alacritty.toml<br />
<div class="outline-text-4" id="text-org70a116d">
<div class="org-src-container">
<pre class="src src-toml"><span class="linenr"> 1: </span>import = ["~/.config/alacritty/themes/nord.toml"]
<span class="linenr"> 2: </span>live_config_reload = true
<span class="linenr"> 3: </span>[window]
<span class="linenr"> 4: </span>dynamic_padding = true
<span class="linenr"> 5: </span>decorations = "None"
<span class="linenr"> 6: </span>padding = { x = 25, y = 25 }
<span class="linenr"> 7: </span>blur = true
<span class="linenr"> 8: </span>#startup_mode = "Fullscreen"
<span class="linenr"> 9: </span>decorations_theme_variant = "Dark"
<span class="linenr">10: </span>[scrolling]
<span class="linenr">11: </span>history = 100000
<span class="linenr">12: </span>multiplier = 2
<span class="linenr">13: </span>[font]
<span class="linenr">14: </span>normal = { family = "SpaceMono Nerd Font", style = "Regular" }
<span class="linenr">15: </span>bold = { family = "SpaceMono Nerd Font", style = "Bold" }
<span class="linenr">16: </span>italic = { family = "SpaceMono Nerd Font", style = "Italic" }
<span class="linenr">17: </span>bold_italic = { family = "SpaceMono Nerd Font", style = "Semibold Italic" }
<span class="linenr">18: </span>size = 11
<span class="linenr">19: </span>[bell]
<span class="linenr">20: </span>animation = "EaseOutCirc"
<span class="linenr">21: </span>duration = 1
<span class="linenr">22: </span># command = { program = "canberra-gtk-play", args = ["-i", "bell"] }
<span class="linenr">23: </span>[cursor]
<span class="linenr">24: </span>style = { shape = "Beam", blinking = "On" }
<span class="linenr">25: </span>vi_mode_style = { shape = "Block", blinking = "Off" }
<span class="linenr">26: </span>[mouse]
<span class="linenr">27: </span>hide_when_typing = true
<span class="linenr">28: </span>[selection]
<span class="linenr">29: </span>save_to_clipboard = true
<span class="linenr">30: </span>[shell]
<span class="linenr">31: </span>program = "/bin/bash"
<span class="linenr">32: </span>args = ["-l"]
<span class="linenr">33: </span>[[hints.enabled]]
<span class="linenr">34: </span>command = "xdg-open"
<span class="linenr">35: </span>hyperlinks = true
<span class="linenr">36: </span>post_processing = true
<span class="linenr">37: </span>persist = false
<span class="linenr">38: </span>mouse.enabled = true
<span class="linenr">39: </span>binding = { key = "U", mods = "Control|Shift" }
<span class="linenr">40: </span> regex = "(ipfs:|ipns:|magnet:|mailto:|gemini://|gopher://|https://|http://|news:|file:|git://|ssh:|ftp://)[^\u0000-\u001F\u007F-\u009F&lt;&gt;\"\\s{-}\\^`]+"
</pre>
</div>
</div>
</li>
<li><a id="org18020ed"></a>Themes<br />
<ul class="org-ul">
<li><a id="org556ea2e"></a>nord<br />
<div class="outline-text-5" id="text-org556ea2e">
<div class="org-src-container">
<pre class="src src-toml"># -*- eval: (rainbow-mode 1) -*-
# Colors (Nord)

# Default colors
[colors.primary]
background = '#2E3440'
foreground = '#D8DEE9'

# Normal colors
[colors.normal]
black   = '#3B4252'
red     = '#BF616A'
green   = '#A3BE8C'
yellow  = '#EBCB8B'
blue    = '#81A1C1'
magenta = '#B48EAD'
cyan    = '#88C0D0'
white   = '#E5E9F0'

# Bright colors
[colors.bright]
black   = '#4C566A'
red     = '#BF616A'
green   = '#A3BE8C'
yellow  = '#EBCB8B'
blue    = '#81A1C1'
magenta = '#B48EAD'
cyan    = '#8FBCBB'
white   = '#ECEFF4'
</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1baa521" class="outline-2">
<h2 id="org1baa521">Scripts</h2>
<div class="outline-text-2" id="text-org1baa521">
</div>
<div id="outline-container-orgbbe8cb1" class="outline-3">
<h3 id="orgbbe8cb1">offlineimap-helper</h3>
<div class="outline-text-3" id="text-orgbbe8cb1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #bc8f8f;">"""Offlineimap helper script"""</span>

<span style="color: #4169e1;">from</span> subprocess <span style="color: #4169e1;">import</span> check_output
<span style="color: #4169e1;">from</span> os <span style="color: #4169e1;">import</span> getenv, path
<span style="color: #4169e1;">import</span> json

<span style="color: #b8860b;">JSON_FILE</span> = <span style="color: #bc8f8f;">"credentials.json"</span>
<span style="color: #4169e1;">if</span> getenv(<span style="color: #bc8f8f;">"XDG_DATA_HOME"</span>) <span style="color: #4169e1;">and</span> path.exists(getenv(<span style="color: #bc8f8f;">"XDG_DATA_HOME"</span>) + <span style="color: #bc8f8f;">"/"</span> + <span style="color: #bc8f8f;">"offlineimap"</span>):
    <span style="color: #b8860b;">JSON_PATH</span> = getenv(<span style="color: #bc8f8f;">"XDG_DATA_HOME"</span>) + <span style="color: #bc8f8f;">"/"</span> + <span style="color: #bc8f8f;">"offlineimap"</span>
<span style="color: #4169e1;">else</span>:
    <span style="color: #b8860b;">JSON_PATH</span> = getenv(<span style="color: #bc8f8f;">"HOME"</span>) + <span style="color: #bc8f8f;">"/"</span> + <span style="color: #bc8f8f;">".local/share/offlineimap"</span>


<span style="color: #b8860b;">f</span> = <span style="color: #00008b;">open</span>(JSON_PATH + <span style="color: #bc8f8f;">"/"</span> + JSON_FILE)
<span style="color: #b8860b;">creds_data</span> = json.load(f)

<span style="color: #4169e1;">def</span> <span style="color: #0000ff;">get_credentials</span>(name, query):
    <span style="color: #4169e1;">for</span> item <span style="color: #4169e1;">in</span> creds_data[<span style="color: #bc8f8f;">"accounts"</span>]:
        <span style="color: #4169e1;">if</span> item[<span style="color: #bc8f8f;">"name"</span>] == name:
            <span style="color: #4169e1;">if</span> query == <span style="color: #bc8f8f;">"host"</span>:
                <span style="color: #4169e1;">return</span> item[<span style="color: #bc8f8f;">"host"</span>]
            <span style="color: #4169e1;">elif</span> query == <span style="color: #bc8f8f;">"port"</span>:
                <span style="color: #4169e1;">return</span> item[<span style="color: #bc8f8f;">"port"</span>]
            <span style="color: #4169e1;">elif</span> query == <span style="color: #bc8f8f;">"user"</span>:
                <span style="color: #4169e1;">return</span> item[<span style="color: #bc8f8f;">"user"</span>]
            <span style="color: #4169e1;">elif</span> query == <span style="color: #bc8f8f;">"passeval"</span>:
                <span style="color: #4169e1;">return</span> item[<span style="color: #bc8f8f;">"passeval"</span>]
</pre>
</div>
<p>
This is a helper script for my <i>offlineimap</i> configuration
</p>
</div>
</div>
<div id="outline-container-org0df0837" class="outline-3">
<h3 id="org0df0837">dunst-backlight</h3>
<div class="outline-text-3" id="text-org0df0837">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">original script from https://wiki.archlinux.org/index.php/Dunst</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">changeBrightness</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Arbitrary but unique message tag</span>
<span style="color: #b8860b;">msgTag</span>=<span style="color: #bc8f8f;">"mybrightness"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Change the volume using alsa(might differ if you use pulseaudio)</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">amixer -c 0 set Master "$@" &gt; /dev/null</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">pamixer --set-volume "${@}" &gt; /dev/null</span>
brightnessctl set <span style="color: #bc8f8f;">"${@}"</span> &gt; /dev/null

<span style="color: #b22222;"># </span><span style="color: #b22222;">Query amixer for the current volume and whether or not the speaker is muted</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">volume="$(amixer -c 0 get Master | tail -1 | awk '{print $4}' | sed 's/[^0-9]*//g')"</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">mute="$(amixer -c 0 get Master | tail -1 | awk '{print $6}' | sed 's/[^a-z]*//g')"</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">volume="$(pamixer --get-volume-human)"</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">mute="$(pamixer --get-mute)"</span>
<span style="color: #b8860b;">max</span>=<span style="color: #bc8f8f;">"$(brightnessctl max)"</span>
<span style="color: #b8860b;">current</span>=<span style="color: #bc8f8f;">"$(brightnessctl get)"</span>
<span style="color: #b8860b;">percentage</span>=<span style="color: #bc8f8f;">"$(awk -v current=${current} -v max=${max} 'BEGIN { print ( (current / max) * 100 )}')"</span>
<span style="color: #b8860b;">percentage</span>=<span style="color: #bc8f8f;">"${percentage%.*}"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Show the brightness notification</span>
dunstify -a <span style="color: #bc8f8f;">"changeBrightness"</span> -u low -i audio-volume-high -h string:x-dunst-stack-tag:$<span style="color: #b8860b;">msgTag</span> <span style="color: #bc8f8f;">\</span>
    -h int:value:<span style="color: #bc8f8f;">"${percentage}"</span> <span style="color: #bc8f8f;">"&#58331; Brightness: ${percentage}%"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Play the brightness changed sound</span>
canberra-gtk-play -i audio-volume-change -d <span style="color: #bc8f8f;">"changeVolume"</span>
</pre>
</div>
</div>
</div>
