index.html
<div id="outline-container-org708ddf4" class="outline-3">
<h3 id="org708ddf4">dunst-volume</h3>
<div class="outline-text-3" id="text-org708ddf4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">original script from https://wiki.archlinux.org/index.php/Dunst</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a></span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">changeVolume</span>

<span style="color: #b8860b;">msgTag</span>=<span style="color: #bc8f8f;">"myvolume"</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">args = -i % or -d %</span>
pamixer <span style="color: #bc8f8f;">"${@}"</span> &gt; /dev/null
<span style="color: #b8860b;">volume</span>=<span style="color: #bc8f8f;">"$(pamixer --get-volume)"</span>
<span style="color: #b8860b;">mute</span>=<span style="color: #bc8f8f;">"$(pamixer --get-mute)"</span>
<span style="color: #4169e1;">if</span> [ <span style="color: #bc8f8f;">"${mute}"</span> == <span style="color: #bc8f8f;">"true"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b8860b;">icon</span>=<span style="color: #bc8f8f;">"audio-volume-muted"</span>
    <span style="color: #b8860b;">symbol</span>=<span style="color: #bc8f8f;">"&#62566;"</span>
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"${mute}"</span> == <span style="color: #bc8f8f;">"false"</span> ] &amp;&amp;
         [ <span style="color: #bc8f8f;">"${volume}"</span> -gt 0 ] &amp;&amp;
         [ <span style="color: #bc8f8f;">"${volume}"</span> -le 25 ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b8860b;">icon</span>=<span style="color: #bc8f8f;">"audio-volume-low"</span>
    <span style="color: #b8860b;">symbol</span>=<span style="color: #bc8f8f;">"&#61478;"</span>
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"${mute}"</span> == <span style="color: #bc8f8f;">"false"</span> ] &amp;&amp;
         [ <span style="color: #bc8f8f;">"${volume}"</span> -gt 25 ] &amp;&amp;
         [ <span style="color: #bc8f8f;">"${volume}"</span> -le 75 ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b8860b;">icon</span>=<span style="color: #bc8f8f;">"audio-volume-medium"</span>
    <span style="color: #b8860b;">symbol</span>=<span style="color: #bc8f8f;">"&#61479;"</span>
<span style="color: #4169e1;">elif</span> [ <span style="color: #bc8f8f;">"${mute}"</span> == <span style="color: #bc8f8f;">"false"</span> ] &amp;&amp;
         [ <span style="color: #bc8f8f;">"${volume}"</span> -gt 75 ]; <span style="color: #4169e1;">then</span>
    <span style="color: #b8860b;">icon</span>=<span style="color: #bc8f8f;">"audio-volume-high"</span>
    <span style="color: #b8860b;">symbol</span>=<span style="color: #bc8f8f;">"&#61480;"</span>
<span style="color: #4169e1;">fi</span>

<span style="color: #4169e1;">if</span> [[ $<span style="color: #b8860b;">volume</span> == 0 || <span style="color: #bc8f8f;">"$mute"</span> == <span style="color: #bc8f8f;">"true"</span> ]]; <span style="color: #4169e1;">then</span>
    dunstify -a <span style="color: #bc8f8f;">"changeVolume"</span> -u low -i <span style="color: #bc8f8f;">"${icon}"</span> -h string:x-dunst-stack-tag:$<span style="color: #b8860b;">msgTag</span> <span style="color: #bc8f8f;">"${symbol} Volume muted"</span>
<span style="color: #4169e1;">else</span>
    dunstify -a <span style="color: #bc8f8f;">"changeVolume"</span> -u low -i <span style="color: #bc8f8f;">"${icon}"</span> -h string:x-dunst-stack-tag:$<span style="color: #b8860b;">msgTag</span> <span style="color: #bc8f8f;">\</span>
    -h int:value:<span style="color: #bc8f8f;">"$volume"</span> <span style="color: #bc8f8f;">"${symbol} Volume: ${volume}%"</span>
<span style="color: #4169e1;">fi</span>

canberra-gtk-play -i audio-volume-change -d <span style="color: #bc8f8f;">"changeVolume"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-11 Mon 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2024-08-02 Fri 12:39</p>
</div>
</body>
</html>
